Repository: VictorMateu/Python-Number-Guessing-Game
Catalog: *.po
Languages: ca, es

source: Welcome player!
ca: Benvingut jugador!
es: Bienvenido jugador

source: Enter your username for the game:
ca: Introduïu el vostre nom d'usuari per al joc:
es: Introduce tu nombre de usuario para el juego:

source: %s, you have to guess a number between 0 and 100
ca: %s, has d'endevinar un nombre entre 0 i 100
es: %s, tienes que adivinar un número entre 0 y 100

source: Congratulations %s! You got the number right!
ca: Felicitats %s! Has encertat el número!
es: ¡Felicidades %s! ¡Tienes el número correcto!

source: The number is smaller than %d
ca: El nombre és inferior a %d
es: El número es menor que %d

source: The number is greater than %d
ca: El nombre és superior a %d
es: El número es mayor que %d

source: Wow... looks like you've run out of tries. the number was %d
ca: Ostres... sembla que t'has quedat sense intents. El nombre era %d
es: Vaya... parece que te has quedado sin intentos. el numero era %d

source: Attempt %d, what do you think the number is?
ca: Intent %d, quin creus que és el número?
es: Intento %d, ¿cuál crees que es el número?

source: We want honest players... and who don't play the fool so much!
ca: Volem jugadors honestos... i que no facin tant el tonto!
es: ¡Queremos jugadores honestos... y que no se hagan tanto el tonto!

source: How many attempts do you want to do?
ca: Quants intents vols fer?
es: ¿Cuántos intentos quieres hacer?

source: At least try once %s!
ca: Almenys ho prova un cop %s!
es: ¡Al menos inténtalo una vez %s!

source: I don't think negative attempts can be made...
ca: No crec que es puguin fer intents negatius...
es: No creo que se puedan hacer intentos negativos...
